app/controllers/users_controller.rb

  def loginUser()
    @action = User.loginUser(params[:user],params[:password])
    if @action > 0
    @prevUser = User.where(:name=>params[:user],:password=>params[:password]).first
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'userbhonsle' AND "users"."password" = 'yolo' LIMIT 1